//------------------------------------------------------------------------
// * @filename: GateServer.h
// *
// * @brief: 网关服务器
// *
// * @author: XGM
// * @date: 2018/05/10
//------------------------------------------------------------------------
#pragma once

#include "xbase/Singleton.h"
#include "xshare/Application.h"

class GateServer : public Application, public Singleton<GateServer>
{
protected:
	friend class Singleton<GateServer>;
	GateServer();
	virtual ~GateServer();
public:
	//------------------------------------------------------------------------
	// 应用名称
	//------------------------------------------------------------------------
	virtual std::string GetName() override;

	//------------------------------------------------------------------------
	// 初始化
	//------------------------------------------------------------------------
	virtual bool Init(int argc, char** argv) override;

	//------------------------------------------------------------------------
	// 退出
	//------------------------------------------------------------------------
	virtual void Exit() override;

	//------------------------------------------------------------------------
	// 运行一帧
	//------------------------------------------------------------------------
	virtual void RunOnce() override;
};
