//------------------------------------------------------------------------
// * @filename: WorldServer.h
// *
// * @brief: 世界服务器
// *
// * @author: XGM
// * @date: 2017/09/08
//------------------------------------------------------------------------
#pragma once

#include "xbase/Singleton.h"
#include "xshare/Application.h"

class WorldServer : public Application, public Singleton<WorldServer>
{
protected:
	friend class Singleton<WorldServer>;
	WorldServer();
	virtual ~WorldServer();
public:
	//------------------------------------------------------------------------
	// 应用名称
	//------------------------------------------------------------------------
	virtual std::string GetName() override;

	//------------------------------------------------------------------------
	// 初始化
	//------------------------------------------------------------------------
	virtual bool Init(int argc, char** argv) override;

	//------------------------------------------------------------------------
	// 退出
	//------------------------------------------------------------------------
	virtual void Exit() override;

	//------------------------------------------------------------------------
	// 运行一帧
	//------------------------------------------------------------------------
	virtual void RunOnce() override;
};
