//------------------------------------------------------------------------
// * @filename: LinkServer.h
// *
// * @brief: 登陆网关服务器
// *
// * @author: XGM
// * @date: 2018/12/27
//------------------------------------------------------------------------
#pragma once

#include "xbase/Singleton.h"
#include "xshare/Application.h"

class LinkServer : public Application, public Singleton<LinkServer>
{
protected:
	friend class Singleton<LinkServer>;
	LinkServer();
	virtual ~LinkServer();
public:
	//------------------------------------------------------------------------
	// 应用名称
	//------------------------------------------------------------------------
	virtual std::string GetName() override;

	//------------------------------------------------------------------------
	// 初始化
	//------------------------------------------------------------------------
	virtual bool Init(int argc, char** argv) override;

	//------------------------------------------------------------------------
	// 退出
	//------------------------------------------------------------------------
	virtual void Exit() override;

	//------------------------------------------------------------------------
	// 运行一帧
	//------------------------------------------------------------------------
	virtual void RunOnce() override;
};
