//------------------------------------------------------------------------
// * @filename: GameServer.h
// *
// * @brief: 游戏服务器
// *
// * @author: XGM
// * @date: 2017/08/08
//------------------------------------------------------------------------
#pragma once

#include "xbase/Singleton.h"
#include "xshare/Application.h"

class GameServer : public Application, public Singleton<GameServer>
{
protected:
	friend class Singleton<GameServer>;
	GameServer();
	virtual ~GameServer();
public:
	//------------------------------------------------------------------------
	// 应用名称
	//------------------------------------------------------------------------
	virtual std::string GetName() override;

	//------------------------------------------------------------------------
	// 初始化
	//------------------------------------------------------------------------
	virtual bool Init(int argc, char** argv) override;

	//------------------------------------------------------------------------
	// 退出
	//------------------------------------------------------------------------
	virtual void Exit() override;

	//------------------------------------------------------------------------
	// 运行一帧
	//------------------------------------------------------------------------
	virtual void RunOnce() override;
};
