//------------------------------------------------------------------------
// * @filename: UserConcreteFactory.h
// *
// * @brief: 创建用户的具体工厂
// *
// * @author: XGM
// * @date: 2018/05/11
//------------------------------------------------------------------------
#pragma once

#include "UserFactory.h"

class UserDefaultFactory : public UserFactory
{
public:
	//------------------------------------------------------------------------
	// 创建用户
	//------------------------------------------------------------------------
	virtual User* NewUser() override;
};
